# Вычислить число c заданной точностью d

# Пример:

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

import math


q = int(input("Введите количество знаков после запятой: "))
k = 1
s = 0
for i in range (10000):
    if i % 2 == 0 :
        s += 4 / k
        print(s)
    else :
       s -= 4 / k
    k += 2


print(round(s,q))


