# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.

# Пример:

# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19} пример не верен
# [2, 2, 2, 2, 2, 3] правильный пример


n = int(input('Enter number: ')) 
l = []

for i in range(1, n + 1):
    res = round((1 + 1 / i)**i)
    l.append(res)
print(l)
print(sum(l))